import os
from flask import Flask, request, redirect, url_for, render_template, send_from_directory, flash, jsonify
from werkzeug.utils import secure_filename
import cv2
import numpy as np
import json
import requests
import tempfile, shutil, os
from PIL import Image
from io import BytesIO

from linebot.models import (
    TemplateSendMessage, AudioSendMessage,
    MessageEvent, TextMessage, TextSendMessage,
    SourceUser, PostbackEvent, StickerMessage, StickerSendMessage, 
    LocationMessage, LocationSendMessage, ImageMessage, ImageSendMessage
)
from linebot.models.template import *
from linebot import (
    LineBotApi, WebhookHandler
)

app = Flask(__name__, static_url_path="/static")

UPLOAD_FOLDER ='static/uploads/'
DOWNLOAD_FOLDER = 'static/downloads/'
ALLOWED_EXTENSIONS = {'jpg', 'png','.jpeg'}

lineaccesstoken = 'wGff8+NiX4eTzzC5gC88FFmZKsTNUDOZYd9wntQ5fKohqronZf9tU9088yYjJ69JADf2RR8At/NzeUeTUczxrbF12s0oEgzJicHEdM54x5sijac69BA2Uq/XuwWUX9SfOBPg+oFwEcY4ATBg0ofRvgdB04t89/1O/w1cDnyilFU='

line_bot_api = LineBotApi(lineaccesstoken)

# APP CONFIGURATIONS
app.config['SECRET_KEY'] = 'opencv'  
app.config['UPLOAD_FOLDER'] = UPLOAD_FOLDER
app.config['DOWNLOAD_FOLDER'] = DOWNLOAD_FOLDER
# limit upload size upto 6mb
app.config['MAX_CONTENT_LENGTH'] = 6 * 1024 * 1024

def allowed_file(filename):
    return '.' in filename and filename.rsplit('.', 1)[1].lower() in ALLOWED_EXTENSIONS

@app.route('/', methods=['GET', 'POST'])
def index():
    if request.method == 'POST':
        if 'file' not in request.files:
            flash('No file attached in request')
            return redirect(request.url)
        file = request.files['file']
        if file.filename == '':
            flash('No file selected')
            return redirect(request.url)
        if file and allowed_file(file.filename):
            filename = secure_filename(file.filename)
            file.save(os.path.join(UPLOAD_FOLDER, filename))
            process_file(os.path.join(UPLOAD_FOLDER, filename), filename)
            data={
                "processed_img":'static/downloads/'+filename,
                "uploaded_img":'static/uploads/'+filename
            }
            return render_template("index.html",data=data)  
    return render_template('index.html')


def process_file(path, filename):
    detect_object(path, filename)
    
def detect_object(path, filename):    
    CLASSES = ["background", "aeroplane", "bicycle", "bird", "boat",
        "bottle", "bus", "car", "cat", "chair", "cow", "diningtable",
        "dog", "horse", "motorbike", "person", "pottedplant", "sheep",
        "sofa", "train", "tvmonitor"]
    COLORS = np.random.uniform(0, 255, size=(len(CLASSES), 3))
    prototxt="ssd/MobileNetSSD_deploy.prototxt.txt"
    model ="ssd/MobileNetSSD_deploy.caffemodel"
    net = cv2.dnn.readNetFromCaffe(prototxt, model)
    image = cv2.imread(path)
    image = cv2.resize(image,(480,360))
    (h, w) = image.shape[:2]
    blob = cv2.dnn.blobFromImage(cv2.resize(image, (300, 300)), 0.007843, (300, 300), 127.5)
    net.setInput(blob)
    detections = net.forward()
    for i in range(0, detections.shape[2]):
        confidence = detections[0, 0, i, 2]
        if confidence > 0.60:
            idx = int(detections[0, 0, i, 1])
            box = detections[0, 0, i, 3:7] * np.array([w, h, w, h])
            (startX, startY, endX, endY) = box.astype("int")

            # display the prediction
            label = "{}: {:.2f}%".format(CLASSES[idx], confidence * 100)
            # print("[INFO] {}".format(label))
            cv2.rectangle(image, (startX, startY), (endX, endY),
                COLORS[idx], 2)
            y = startY - 15 if startY - 15 > 15 else startY + 15
            cv2.putText(image, label, (startX, y),
                cv2.FONT_HERSHEY_SIMPLEX, 0.5, COLORS[idx], 2)

    cv2.imwrite(f"{DOWNLOAD_FOLDER}{filename}",image)

@app.route('/callback', methods=['POST'])
def callback():
    json_line = request.get_json(force=False,cache=False)
    json_line = json.dumps(json_line)
    decoded = json.loads(json_line)
    
    # เชื่อมต่อกับ line 
    no_event = len(decoded['events'])
    for i in range(no_event):
            event = decoded['events'][i]
            event_handle(event,json_line)

    # เชื่อมต่อกับ dialogflow
    #intent = decoded["queryResult"]["intent"]["displayName"] 
    #text = decoded['originalDetectIntentRequest']['payload']['data']['message']['text'] 
    #reply_token = decoded['originalDetectIntentRequest']['payload']['data']['replyToken']
    #id = decoded['originalDetectIntentRequest']['payload']['data']['source']['userId']
    #disname = line_bot_api.get_profile(id).display_name
    #reply(intent,text,reply_token,id,disname)

    return '',200

def reply(intent,text,reply_token,id,disname):
    text_message = TextSendMessage(text="ทดสอบ")
    line_bot_api.reply_message(reply_token,text_message)

def event_handle(event,json_line):
    print(event)
    try:
        userId = event['source']['userId']
    except:
        print('error cannot get userId')
        return ''

    try:
        rtoken = event['replyToken']
    except:
        print('error cannot get rtoken')
        return ''
    try:
        msgId = event["message"]["id"]
        msgType = event["message"]["type"]
    except:
        print('error cannot get msgID, and msgType')
        sk_id = np.random.randint(1,17)
        replyObj = StickerSendMessage(package_id=str(1),sticker_id=str(sk_id))
        line_bot_api.reply_message(rtoken, replyObj)
        return ''

    if msgType == "text":
        msg = str(event["message"]["text"])
        if msg == "คณิตศาสตร์พื้นฐาน 1 ค31101 ภาคเรียนที่1":
            replyObj = TextSendMessage(text="คณิตศาสตร์พื้นฐาน 1 ค31101 ภาคเรียนที่ 1บทที่ 1 เซต- เซต คือลักษณะนามใช้เรียกกลุ่มสิ่งของต่างๆ สิ่งที่อยู่ในกลุ่มเรียกว่า สมาชิกของเซต เขียนเซตได้ 2 แบบ คือ แบบแจกแจงสมาชิกกับแบบบอกเงื่อนไขสมาชิก- เซตมี 3 ชนิด คือเซตจำกัด (ระบุจำนวนสมาชิกได้), เซตอนันต์ (ไม่สามารถระบุจำนวนสมาชิกได) และเซตว่าง (ไม่มีสิ่งใดที่เป็นสมาชิกของเซต)- เอกภพสัมพัทธ์ คือเซตที่กำหนดขึ้นมาหนึ่งเซต ไม่กล่าวถึงสิ่งอื่นนอกจากสมาชิกที่กำหนด แทนด้วย U และแผนภาพเวนน์-ออยเลอร์ คือแผนภาพที่เขียนแสดงความสัมพันธ์ของเซตต่าง ๆ- ยูเนียน คือเซตที่มีสมาชิกร่วมกัน ส่วนอินเตอร์เซ็กชัน คือเซตที่มีสมาชิกเหมือนกัน- คอมพลีเมนต์ของเซต A คือเซตของทุกสมาชิกในเอกภพสัมพัทธ์ U ที่ไม่อยู่ใน A ส่วนผลต่างของเซต A และ B คือเซตของทุกสมาชิกเซต A ที่ไม่เป็นสมาชิกของเซต Bบทที่ 2 ตรรกศาสตร์ (Logic)- ตรรกศาสตร์ หมายถึงวิชาที่ว่าด้วยการให้เหตุผล- ประพจน์ หมายถึงข้อความที่เป็นประโยคบอกเล่าหรือปฏิเสธที่บอกได้ว่าจริงหรือเท็จ ส่วนข้อความที่ไม่เป็นประพจน์ หมายถึงข้อความที่ไม่สามารถบอกได้ว่าจริงหรือเท็จ เช่น คำถาม, คำสั่ง, ขอร้อง, อุทาน, อวยพร, มีตัวแปร, สุภาษิต เป็นต้น- ค่าความจริงมี 2 ชนิด คือจริง (T) กับเท็จ (F)- ตัวเชื่อมของประพจน์มี 5 คำ คือและ ∧ , หรือ ∨ , ถ้า...แล้ว → , ก็ต่อเมื่อ ⇔ และไม่/ไม่ใช่ ~- นิเสธของประพจน์ หมายถึงข้อความที่ปฏิเสธข้อความเดิม- สัจนิรันดร์ คือรูปแบบของประพจน์ที่มีค่าความจริงเป็นจริงทุกกรณี ส่วนการขัดแย้ง คือรูปแบบของประพจน์ที่มีค่าความจริงเป็นเท็จทุกกรณี- ประโยคเปิด คือประโยคบอกเล่าหรือปฏิเสธที่กล่าวถึงสมาชิกในเอกภพสัมพัทธ์ในรูปของตัวแปร ซึ่งประโยคเปิดไม่เป็นประพจน์ เพราะบอกไม่ได้ว่าจริงหรือเท็จ")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "คณิตศาสตร์พื้นฐาน 2 ค31102 ภาคเรียนที่ 2":
            replyObj = TextSendMessage(text="คณิตศาสตร์พื้นฐาน 2 ค31102 ภาคเรียนที่ 2 บทที่ 1 หลักการนับเบื้องต้น- หลักการบวก คือการนับจํานวนสิ่งของ เหตุการณ์ หรือวิธีการทํางานที่ไม่สามารถทําพร้อมกันได้ ใช้วิธี n1 + n2- หลักการคูณ คือการนับจํานวนสิ่งของ เหตุการณ์ หรือวิธีการทํางานที่ต้องทําต่อเนื่องกัน ใช้วิธี n1 × n2 - แฟกเทอเรียล เขียนแทนด้วย n! อ่านว่าเอ็นแฟกเทอเรียล โดย n เป็นจํานวนเต็มบวกแต่บางทีก็ใช้ 0!- การเรียงสับเปลี่ยนเชิงเส้นของสิ่งของที่แตกต่างกันทั้งหมดเป็นการนําสิ่งของมาเรียงสับเปลี่ยนในแนวเส้นตรง มี 2 กรณี คือเมื่อมี n สิ่ง ที่แตกต่างกันแล้วนํามาเรียงสับเปลี่ยนทั้ง n สิ่งนั้น และอีกกรณีคือเมื่อมีของ n ชิ้น ที่ แตกต่างกันแล้วนํามาเรียงสับเปลี่ยน r ชิ้น (เรียงไม่ทั้งหมด) ใช้สัญลักษณ์ P (n, r)-การจัดหมู่ของสิ่งของที่แตกต่างกนัทั้งหมดคือจํานวนวิธีเลือกสุ่มสิ่งของมาโดยไมพ่ิจารณาลําดับก่อนหลังใช้ สัญลักษณ์คือ C(n, r)บทที่ 2 ความน่าจะเป็น (Probability)- ความน่าจะเป็น คือการศึกษาเกี่ยวกับโอกาสที่จะเกิดขึ้นของเหตุการณ์ต่างๆ- การทดลองสุ่ม คือการทดลองซึ่งทราบว่าผลลัพธ์ว่าจะเป็นอะไรได้บ้าง แต่ไม่สามารถบอกได้อย่างถูกต้องว่า ในแต่ละครั้งผลที่เกิดขึ้นจะเป็นอย่างไร- ปริภูมิตัวอย่างหรือแซมเปิลสเปซ คือเซตที่ มีสมาชิกเป็นผลลัพธ์ที่อาจเป็นไปได้ทั้งหมดของการสุ่ม แทนด้วย S ส่วนจํานวนสมาชิกแซมเปิลสเปซแทนด้วย n(S)- เหตุการณ์ คือสับเซตของแซมเปิลสเปซ แทนด้วย E ส่วนจํานวนสมาชิกเหตุการณ์แทนด้วย n€- ความน่าจะเป็นของเหตุการณ์ คืออัตราส่วนระหว่างจํานวนสมาชิกเหตุการณ์ที่สนใจกับจํานวนสมาชิกแซม เปิลสเปซที่มีโอกาสเกิดขึ้นเท่า ๆ กัน แทนด้วย P€บทที่ 3 ความสัมพันธ์และฟังก์ชัน- ผลคูณคาร์ทีเซียนของเซต A และ B คือเซตของคู่อันดับที่สมาชิกตัวหน้ามาจากเซต A และตัวหลังมาจากเซต B- โดเมนและเรนจ์ของความสัมพันธ์ โดยโดเมนของ r คือเซตที่มีสมาชิกตัวหน้าของทุกคู่อันดับใน r แทนด้วย Dr ส่วนเรนจ์ของ r คือเซตที่มีสมาชิกตัวหลังของทุกคู่อันดับใน r แทนด้วย Rr-ฟังก์ชันคือความสัมพันธ์ซงึ่สมาชิกในโดเมนแต่ละตัวจับคู่กับสมาชิกในเรนจ์ของความสัมพันธ์ตัวเดียวเท่านั้น แทนด้วย f- ฟังก์ชันผกผัน คือความสัมพันธ์ที่เกิดจากการสลับที่ของสมาชิกตัวหน้าและตัวหลัง - การดําเนินการของฟังก์ชันมี 4 แบบ คือผลบวก, ผลต่าง, ผลคูณ และผลหาร- ฟังก์ชันประกอบเป็นฟังก์ชันทมี่ มีโดเมนและเรนจ์เป็นสับเซตของจํานวนจริง")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "ความรู้พื้นฐานสําหรับแคลคูลัส 1 ค31201 ภาคเรียนที่ 1":
            replyObj = TextSendMessage(text="ความรู้พื้นฐานสําหรับแคลคูลัส 1 ค31201 ภาคเรียนที่ 1 บทที่ 1 ระบบจํานวนจริง- จํานวนจริงมี 6 ชนิด คือจํานวนนับ หรือจํานวนธรรมดา หรือจํานวนเต็มบวก แทนด้วย N หรือ I+ , จํานวน เต็มลบ แทนด้วย I-, จํานวนเต็มศูนย์ แทนด้วย I0, จํานวนตรรกยะ คือจํานวนที่เขียนในรูปเศษส่วนได้ โดยที่ เศษส่วนเป็นจํานวนเต็ม แทนด้วย Q, จํานวนอตรรกยะ คือจํานวนที่ไม่สามารถเขียนในรูปเศษส่วนได้ แทน ด้วยQ’- การแก้สมการ หมายถึงการหาคําตอบของสมการ ส่วนการแก้สมการกําลังสองตัวแปรเดียวทําได้หลายวิธี คือ แยกตัวประกอบ และใช้สูตร- อสมการ คือประโยคที่แสดงถึงความสัมพันธ์ของจํานวน โดยมีสัญลักษณ์ < , > , ≤ , ≥ หรือ ≠ - การแก้อสมการพหุนามสามารถแก้ได้ 2 วิธี คือทฤษฎีเศษเหลือกับทฤษฎีบทตัวประกอบ- ค่าสัมบูรณ์ของ a หมายถึงระยะทางจากจุด 0 ถึงจุด a แทนด้วย | a |บทที่ 2 เรขาคณิตวิเคราะห์- การหาระยะทางระหว่างจุดสองจุด มีนิยามคือ ถ้า P และ Q เป็นจุดสองจุด ระยะทางระหว่าง P และ Q แทนด้วย PQ- การประยุกต์เรื่องการหาระยะทางระหว่างจุดสองจุดกับสถานการณ์ต่างๆ เช่น พิสูจน์ว่าจุดทั้งสามอยู่บนเส้น เดียวกันหรือไม่, ตรวจสอบว่าจุดทั้งสามเป็นจุดยอดของรูปสามเหลี่ยมชนิดใด- ความชันของเส้นตรง มีบทนิยามคือกําหนด P1(x1, y1) และ P2(x2, y2) โดยที่ x1 ≠ x2 และให้ m แทน ความชันระหว่างจุดสองจุด- ลักษณะสมการเส้นตรงมี 3 ชนิด คือขนานแกน x (By + C = 0), ขนานแกน y (Ax + C = 0), ไม่ขนานแกน x และ y (Ax + By + C = 0)- การหาสมการเส้นตรงจะต้องทราบความชันของเส้นตรงและจุดที่เส้นตรงผ่าน จากนั้นนําความชันและจุดที่เส้นตรงผ่านแทน y – y1 = m(x – x1) สุดท้ายจัดให้อยู่ในรูป Ax + By + C = 0")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "ความรู้พื้นฐานสําหรับแคลคูลัส 2 ค31202 ภาคเรียนที่ 2":
            replyObj = TextSendMessage(text="ความรู้พื้นฐานสําหรับแคลคูลัส 2 ค31202 ภาคเรียนที่ 2 บทที่ 1 ภาคตัดกรวย- ภาคตัดกรวย คือรูปในระนาบที่เกิดจากการตัดกันของระนาบกับกรวย มี 4 รูปแบบ คือเมื่อระนาบตั้งฉากกับ แกนของกรวย ระนาบตัดกรวยข้างเดียว เรียกว่าวงกลม, เมื่อระนาบไม่ตั้งฉากกับแกนของกรวยแต่ทํามุมแหลม กับแกนของกรวย ระนาบตัดกรวยข้างเดียว เรียกว่าวงรี, เมื่อระนาบขนานกับตัวก่อกําเนิดกรวย ระนาบตัด กรวยข้างเดียว เรียกว่าพาราโบลา และเมื่อระนาบขนานกับแกนของกราย ระนาบตัดกรวยสองข้าง เรียกว่า ไฮเพอร์โบลา- ภาคตัดกรวยวงกลม คือเซตของจุดทั้งหมดในระนาบที่ห่างจากจุด ๆ หนึ่งที่ตรึงอยู่กับที่เป็นระยะทางคงตัว จุดที่ตรึงอยู่กับที่คือจุดศูนย์กลาง ส่วนระยะทางคงตัวคือรัศมี (r) สมการวงกลมมีจุดศูนย์กลางอยู่ที่ (h, k) ซึ่ง สูตรคือ (x - h)2 + (y - k)2 = r2- ภาคตัดกรวยวงรี คือเซตของจุดทั้งหมดในระนาบ ซึ่งผลบวกของระยะทางจากจุด ๆ ใดไปจุด F1 และ F2 ที่ ตรึงอยู่กับที่ โดยค่าคงตัวมีค่ามากกว่าระยะห่างของจุดที่ตรึงอยู่ ส่วนประกอบมีจุดโฟกัส (F, F'), จุดศูนย์กลาง, จุดยอด (V, V'), แกนวงรีหรือแกนสมมาตร, แกนเอก, แกนโท และเลตัสเรคตัม- ภาคตัดกรวยพาราโบลา คือเซตของจุดทั้งหมดบนระนาบ ซึ่งห่างจากจุด F ที่ตรึงกับที่และเส้นตรงที่ตรึงกับที่ เป็นระยะทางเท่ากันส่วนประกอบมีจุดโฟกัส,เส้นไดเรคตริกส์,แกนพาราโบลาหรือแกนสมมาตร,จุดยอด และเลตัสเรคตัม สมการแนวนอนคือ y2 = 4cx แนวตั้งคือ x2 = 4cy- ภาคตัดกรวยไฮเพอร์โบลา คือเซตของจุดทั้งหมดบนระนาบ ซึ่งผลต่างของระยะทางจากจุดใด ๆ ไปจุด F1 และ F2 ที่ตรึงกับที่มีค่าคงตัว โดยค่าคงตัวมีค่าน้อยกว่าระยะห่างของจุดที่ตรึงอยู่ ส่วนประกอบมีจุดโฟกัส, จุด ศูนย์กลาง, แกนไฮเพอร์โบลาหรือแกนสมมาตร, แกนตามขวาง, แกนสังยุค, เลตัสเรคตัม และเส้นกํากับบทที่ 2 เมทริกซ์ (Matrix)- เมทริกซ์ คือกลุ่มของจํานวนที่เรียงเป็นรูปสี่เหลี่ยมมุมฉาก โดยแต่ละแถวมีจํานวนเท่า ๆ กัน อยู่ใน เครื่องหมาย [ ] ซึ่งจํานวนใน [ ] เรียกว่าสมาชิกของเมทริกซ์- มิติ คือ แถว × หลัก ซึ่งแถวคือแนวนอน ส่วนหลักคือแนวตั้ง- ชนิดของเมทริกซ์ มี 5 ชนิด คือจัตุรัส (แถว = หลัก), ศูนย์ (สมาชิกเมทริกซ์เป็น 0 ทุกตัว), เอกลักษณ์ (เป็น เมทริกซ์จัตุรัสและมี 1 เป็นสมาชิกแนวทแยงขวา), แถว (มี 1 แถว), หลัก (มี 1 หลัก)- การบวกลบเมทริกซ์ จะสามารถบวกลบกันได้ก็ต่อเมื่อมมี มิติเท่ากัน ตําแหน่งเดียวกัน - การคูณเมทริกซ์ด้วยจํานวนจริง คือเอาจํานวนจริงคูณสมาชิกทุกตัวในเมทริกซ์- การคูณเมทริกซ์ด้วยเมทริกซ์ จะสามารถคูณกันได้ก็ต่อเมื่อหลักของตัวหน้า = แถวของตัวหลัง จะได้คําตอบ เป็นแถวของตัวหน้า × หลักของตัวหลัง- การแก้ระบบสมการเชิงเส้นโดยใช้เมทริกซ์ มี 3 วิธี คืออินเวอร์สการคูณของเมทริกซ์, กฎของคราเมอร์ และการดําเนินการตามแถว (~)")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "ภาษาไทย 1 ท31101 ภาคเรียนที่ 1":
            replyObj = TextSendMessage(text="ภาษาไทย 1 ท31101 ภาคเรียนที่ 1• บทที่ 1 คํานมัสการคุณานุคุณแบ่งออกเป็น 5 ตอน เป็นการพรรณนาคุณงามความดีที่พระพุทธ พระธรรม พระสงฆ์ บิดามารดา และครู อาจารย์มีต่อชนทุกชั้น เนื้อหาส่วนใหญ่จะเกี่ยวเนื่องในทางพุทธศาสนา มีเนื้อหาที่ละเอียดลึกซึ้ง แต่งด้วย อินทรวิเชียรฉันท์ 11 และกาพย์ฉบัง 16• บทที่ 2 อิเหนา ตอน ศึกกะหมังกุหนิงเป็นวรรณคดีบทละครรําที่มีมาตั้งแต่สมัยกรุงศรีอยุธยา มีที่มาจากนิทานปันหยีที่ถูก แต่งเป็นกลอนบทละครที่ มีลักษณะบังคับเหมือนกลอนสุภาพ โดยรัชกาลที่ 2 ได้ทรงดัดแปลงแก้ไขให้เข้ากับธรรมเนียมและรสนิยมของ คนไทย• บทที่ 3 นิทานเวตาล (เรื่องที่ 10)เป็นวรรณกรรมสันสกฤตโบราณ ที่แทรกสุภาษิตและคติธรรมไว้และจะได้ศึกษาเรื่องความเป็นอยู่ ความเชื่อประเพณี พิธีกรรม และวัฒนธรรมอินเดียโบราณ ที่แต่งโดยร้อยแก้ว • บทที่ 4 นิราศนรินทร์คําโคลงเนื้อหาเป็นการคร่ำครวญและพรรณนาความรู้สึกอาลัยอาวรณ์ที่มีต่อนางอนัเป็นที่รักด้วยสํานวนโวหารแต่งด้วยคําประพันธ์ประเภทร่ายสุภาพ 1 บท และโคลงสี่สุภาพ 143 บท")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "ภาษาไทย 2 ท31102 ภาคเรียนที่ 2":
            replyObj = TextSendMessage(text="ภาษาไทย 2 ท31102 ภาคเรียนที่ 2• บทที่ 5 หัวใจชายหนุ่มเนื้อหาจะเป็นวรรณกรรมแบบตะวันตก เป็นการเล่าเรื่องราวชีวิตของนักเรียนนอกในยุคที่สังคมไทยกําลังปรับเปลี่ยนไปตามอิทธิพลของวัฒนธรรมตะวันตก โดยนําเสนอในรูปแบบของจดหมาย มีทั้งหมด 18 ฉบับ• บทที่ 6 ทกุ ข์ของชาวนาในบทกวีเป็นบทความแสดงความคิดเห็น โดยอ้างถึงบทกวีของจิตร ภูมิศักดิ์และหลี่เชิน ที่มีจุดมุ่งหมายจะแสดงถึงความทุกข์ยากของชาวนาในทุกที่และทุกยุคสมัย• บทที่ 7 มงคลสูตรคําฉันท์เป็นวรรณคดีคําสอนแบบร้อยกรองประเภทคําฉันท์ ที่ให้พุทธศาสนิกชนได้ยึดถือและปฏิบัติมีทั้งหมด 38ประการ ขึ้นต้นด้วยคาถาบาลีและตามด้วยร้อยกรอง• บทที่ 8 มหาชาติหรือมหาเวสสันดรชาดกจะได้รู้เรื่องโดยย่อของมหาชาติทั้ง 13 กัณฑ์ รู้ลักษณะของมหาชาติในแต่ละภาค ที่แต่งด้วยคําประพันธ์ประเภทฉันท์")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "ภาษาอังกฤษพื้นฐาน 1 อ31101 ภาคเรียนที่ 1":
            replyObj = TextSendMessage(text="ภาษาอังกฤษพื้นฐาน 1 อ31101 ภาคเรียนที่ 1- Present Simple Tenseประโยคที่มีโครงสร้างแบบง่าย ๆ เพื่อใช้พูดถึงเหตุการณ์ในปัจจุบัน โดยมีลักษณะต่าง ๆ ดังนี้บอกเล่า: Subject + Verb.1(s,es)ปฏิเสธ: แบบที่ 1 : Subject + Verb to be + not + Verb.1แบบที่ 2 : Subject + Verb to do + not + Verb.1 คําถาม: แบบที่ 1 : Verb to be + Subject + Verb.1?แบบที่ 2 : Verb to do + Subject + Verb.1? - Unit1: Life in Cityพูดถึงความโดดเด่นของอัสตานาศูนย์กลางแห่งใหม่ของคาซัคสถาน และยังเป็นเมืองที่สร้างยุคใหม่ของเมืองมี ตึกระฟ้าที่น่าตื่นเต้นและสะดุดตายังมีการสร้างสิ่งแปลกตาคือหอคอยแบร์เตียเรียกที่เป็นสัญลักษณ์ของเมือง มีความสูงที่ 345 ฟุต ดูใหญ่มหึมาเหมือนต้นไม้ที่มีไข่ทองคำอยู่ข้างใน อัสตานามีหน้าร้อนที่น่าพอใจ แต่อากาศ ก็ค่อนข้างที่จะหนาว ชาวเมืองจึงเลือกที่จะทํากิจกรรมในร่มกันส่วนใหญ่ สถานที่ที่เป็นชื่อเสียงก็คือ Khan Shatyr หรือเต็นท์ที่สูงที่สุดในคาซัคสถาน- Present Continuous Tenseบอกถึงเหตุการณ์ที่กําลังเกิดขึ้น ณ ขณะที่พูด หรือเป็นเหตุการณ์ที่กําลังจะเกิดขึ้นในอนาคตอันใกล้(ซึ่งมีการ วางแผน)บอกเล่า: Subject + V. to be + V.ing ปฏิเสธ: Subject + V. to be + not + V.ing คําถาม: V. to be + Subject + V.ing?- Preposition of place & TimeIn: เดือน/ปี, ช่วงของวัน, สถานที่หรือสิ่งทั่วไปที่มีขอบเขตชัดเจน,ยานพาหนะประเภทรถยนต์ทั่วไปOn: วันที่/วัน, วันหยุด/วันเทศกาล (แบบมีคําว่าday), ระบุตําแหน่งสิ่งที่อยู่บนพื้นผิวของสิ่งอื่น, บนถนนหรือ พื้นที่ตามแนวถนน, ชั้นของอาคาร, ยานพาหนะประเภทขนส่งมวลชน จักรยาน และมอเตอร์ไซค์At: บอกเวลากี่โมง/กี่นาที, เที่ยงคืน/เที่ยงวัน, วันหยุด/วันเทศกาล (แบบไม่มีคําว่าday), จุดตําแหน่งเฉพาะ, สถานที่ทั่วไป, ใช้บอกสถานที่ทํางาน หรือโรงเรียน,ใช้บอกที่อยู่- Modal Verbsใช้แสดงความเป็นไปได้และแนวโน้มของความเป็นไปได้ แสดงได้ทั้งความเป็นปัจจุบัน และความเป็นอนาคตแบ่งได้ 3 ระดับ 1)เป็นไปได้มาก(ในปัจจุบันหรือในอนาคต): can,will,must 2)เป็นไปได้ปานกลาง(ในปัจจุบันหรือในอนาคต): may,might,could,should4) 3)เป็นไปได้น้อย(ในปัจจุบันหรือในอนาคต): could")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "ภาษาอังกฤษพื้นฐาน 2 อ31102 ภาคเรียนที่ 2":
            replyObj = TextSendMessage(text="ภาษาอังกฤษพื้นฐาน 2 อ31102 ภาคเรียนที่ 2- Past Simple Tenseโครงสร้างประโยคที่เราใช้เล่าเหตุการณ์ต่าง ๆ ในอดีต ที่สิ้นสุดไปแล้ว หรือกิจกรรมที่เราเคยทําเป็นนิสัย แต่ว่า เลิกทําไปแล้ว จะมีการใช้ was/wereบอกเล่า: Subject + Verb.2ปฏิเสธ: Subject + Did + not + Verb.1 คําถาม: Did + Subject + Verb.1?- Past Continuous Tense ประโยคที่กล่าวถึงเหตุการณ์ที่กําลังเกิดขึ้นอย่างต่อเนื่องในอดีต บอกเล่า: Subject + was/were + V.ingปฏิเสธ: Subject + was/were + not + V.ingคําถาม: Was/Were+ Subject + V.ing- Count & Uncountable NounCount: คํานามนับได้มีทั้งคํานามเอกพจน์ (singular noun) คือ มีเพียงสิ่งเดียวหรืออันเดียวเวลานําไปใช้ ก็ใส่ จํานวน 1 หรือ one ไว้ข้างหน้าก็ได้ หรือใช้ a หรือ an นําหน้าก็ได้ สามารถใช้จํานวนนับ (1, 2, 3, ...) นําหน้าเพื่อบอกจํานวนได้ และคํานามตัวนั้นก็เติม s/es เพื่อให้เป็นคํานามพหูพจน์Uncountable: คํานามนับไม่ได้เป็นได้แค่คํานามเอกพจน์เท่านั้น จะไม่มีรูปพหูพจน์ เมื่อไม่มี รูปพหูพจน์ก็จะ ใส่จํานวนลงไปไม่ได้ และจะใส่ a/an นําหน้าไม่ได้ แต่เราจะใส่ภาชนะเข้าไปด้วยเพื่อให้นับเป็นจํานวนได้ เวลาถามจํานวนใช้ How much + คํานามเอกพจน์ เพื่อถามจํานวน - Quantifiersเราจะได้เรียนคําบอกปริมาณต่างๆที่จะพบเจอในชีวิต เช่น few, a few, little, a little, some, any, many, much, lots of, a lots of- Comparison (Comparative & Superlative Degree)การเปรียบเทียบ คือการใช้คําคุณศัพท์ หรือ adjective มาเปรียบเทียบในภาษาอังกฤษ แบ่งได้เป็น การ เปรียบเทียบขั้นกว่า (Comparative Degree) และการเปรียบเทียบขั้นสุด (Superlative Degree)- Future Simple Tense ประโยคกล่าวถึงเหตุการณ์ในอนาคต เอาไว้พูดถึงเรื่องราวในอนาคต บอกเล่า: Subject + will/shall + Verb.1ปฏิเสธ: Subject + will/shall + not + Verb.1คําถาม: Will/Shall + Subject + Verb.1?- Present Perfect Tense เป็นเหตุการณ์ในอดีตที่มีผลต่อเนื่องถึงปัจจุบัน บอกเล่า: Subject + has / have + Verb.3 ปฏิเสธ: Subject + has / have + not + Verb.3คําถาม: Has/Have + Subject + Verb.3?")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "วิทยาศาสตร์ชีวภาพ ว30141 ภาคเรียนที่ 1":
            replyObj = TextSendMessage(text="วิทยาศาสตร์ชีวภาพ ว30141 ภาคเรียนที่ 1 บทที่ 1 การลําเลียงสารเข้าและออกจากเซลล์- การลําเลียงสารเข้าและออกจากเซลล์ แบบผ่านเยื่อหุ้มเซลล์มีกลไกคือ โมเลกุลละลายเข้ากับไขมันในเยื่อหุ้ม เซลล์ แทรกซมึ ผ่านรูโดยรวมตัวกับตัวพาในเยื่อหุ้มเซลล์ แบบไม่ผ่านเยื่อหุ้มเซลล์ มีการนําสารเข้าและนําสาร ออก- การแบ่งเซลล์ มี2ขั้นตอน คือ แบ่งนิวเคลียส(ไมโทซิส/ไมโอซสิ ) และแบ่งไซโทพลาสซึม(ในเซลล์พืชจะสร้าง แผ่นกั้นเซลล์ เซลล์สัตว์เยื่อหุ้มเซลล์จะคอดเข้าหากันจนแยกออกจากกัน)บทที่ 2 การรักษาดุลยภาพของร่างกายมนุษย์- การรักษาดุลยภาพของนํ้าในร่างกาย(อวัยวะที่สําคัญคือไต)ถ้าปริมาณนํ้าในเลือดเปลี่ยนไปจากปกติ สมอง ส่วนไฮโพทาลามัสจะกระตุ้นหรือยับยั้งการหลั่งADHมากขึ้นหรอื น้อยลงจากต่อมใต้สมองส่วนหลัง ทําให้ท่อ หน่วยไตและท่อรวมดูดกลับนํ้าเพิ่มขึ้นหรือลดลง- การรักษาดุลยภาพของแร่ธาตุในร่างกาย เช่น กรณีปริมาณโซเดียมตํ่า จะมีการกระตุ้นต่อมหมวกไตให้หลั่ง ฮอร์โมนแอลโดสเตอโรน ไปกระตุ้นท่อหน่วยไตและท่อรวมดูดกลับโซเดียมและนํ้าเข้าสู่กระแสเลือด- การรักษาดุลยภาพกรด-เบสของเลือด ไตขับไฮโดรเจนไอออน และแอมโมเนียมไอออนไปกับปัสสาวะ ปอด กําจัดโดยการหายใจออกเพื่อนําแก๊สคาร์บอนไดออกไซดอ์ อกจากร่างกาย- การรักษาดุลยภาพของอุณหภูมิภายในร่างกาย มีสมองส่วนไฮโพทาลามัสเป็นศูนย์ควบคุมอุณหภูมิในร่างกาย- ระบบภูมิคุ้มกัน กลไกการต่อต้านหรือ ทําลายสิ่งแปลกปลอม แบ่งเป็นแบบไม่จําเพาะและแบบจําเพาะ ความผิดปกติของระบบภูมิคุ้มกัน(อาการ โรคต่างๆ)บทที่ 3 การดํารงชีวิตของพืช- สารอินทรีย์ในพืช มีทั้งจําเป็นและไม่จําเป็นต่อการเจริญเติบโตของพืชโดยตรง- ปัจจัยบางประการที่มีผลต่อการเจริญเติบโตของพืช(ปัจจัยภายนอก,ปัจจัยภายใน)-การตอบสนองของพืชต่อสิ่งเร้า(มีทิศทางสัมพันธ์/ไม่สัมพนัธ์กับทิศทางของสิ่งเร้า)บทที่ 4 พันธุกรรมและวิวัฒนาการ- การถ่ายทอดลักษณะทางพันธุกรรม+ที่เป็นส่วนขยายของพันธุศาสตร์เมนเดล มัลติเพิลแอลลีล ยีนที่อยู่บนโครโมโซมเพศ-ยีนกับการควบคุมลักษณะทางพันธุกรรม(ผ่านการสังเคราะห์โปรตีน)- การเปลี่ยนแปลงทางพันธุกรรม(การเกิดมิวเทชันระดับยีน+โครโมโซม)- เทคโนโลยีทางดีเอ็นเอ(ด้านการแพทย์และเภสัชกรรม,การเกษตร,นิติวิทยาศาสตร์,อุตสาหกรรม,ความ ปลอดภัยทางชีวภาพและชีวจริยธรรม)- วิวัฒนาการและความหลากหลายของสิ่งมีชีวิต(ความหลากหลายทางพันธุกรรม,การคัดเลือกโดยธรรมชาติ)")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "ดุลยภาพ ว31241 ภาคเรียนที่ 1":
            replyObj = TextSendMessage(text="ดุลยภาพ ว31241 ภาคเรียนที่ 1 บทที่ 1 การศึกษาชีววิทยา- ธรรมชาติของสิ่งมีชีวิต คุณสมบัติ7ประการของสิ่งมีชีวิต ชีววิทยากับการดํารงชีวิต ชีวจริยธรรม- การศึกษาชีววิทยาและวิธีการทางวิทยาศาสตร์(สังเกต กําหนดปัญหา ตั้งสมมติฐาน ตรวจสอบสมมติฐาน เก็บรวบรวมข้อมูลและวิเคราะห์ข้อมูล สรุปผลการทดลอง) ความรู้ กระบวนการบทที่ 2 เคมีที่เป็นพื้นฐานของสิ่งมีชีวิต- อะตอม ธาตุและสารประกอบ อะตอมประกอบด้วย โปรตอน นิวตรอน และอิเล็กตรอน นิวตรอนอยู่ใน นิวเคลียส ผลรวมของโปรตอนกับนิวตรอนเรียกว่า เลขมวล ตัวเลขแสดงจํานวนโปรตอนเรียกว่า เลขอะตอม- พันธะเคมี คือการรวมตัวกันของอะตอมหรือไอออนด้วยแรงยึดเหนี่ยว พันธะโคเวเลนท์(แรงยึดเหนี่ยว ระหว่างอะตอมกับอะตอม ใช้เวเลนท์อิเล็กตรอนร่วมกัน) พันธะไอออนกิ (มีการให้และรับเวเลนท์อิเล็กตรอน เป็นการยึดเหนี่ยวระหว่างประจุไฟฟ้าของไอออนบวก/ลบ) พันธะไฮโดรเจน(เเรงยึดเหนี่ยวระหว่างโมเลกุลกับ โมเลกุล อาจเป็นชนิดเดียวกันหรือต่างชนิดกัน)- นํ้า เป็นองค์ประกอบของสิ่งมีชีวิตที่มีมากที่สุดในร่างกาย ช่วยรักษาดุลยภาพของเซลล์- สารประกอบคาร์บอนในสิ่งมีชีวิต(คาร์โบไฮเดรต,โปรตีน,ลิพิด,กรดนิวคลีอิก) -ปฏิกิริยาเคมีในเซลล์ของสิ่งมีชีวิต(ดูดและคายพลังงาน)")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "Genetic ว31242 ภาคเรียนที่ 2":
            replyObj = TextSendMessage(text="Genetic ว31242 ภาคเรียนที่ 2 บทที่ 3 เซลล์และการทํางานของเซลล์- โครงสร้างและหน้าที่ของเซลล์ เซลล์มี2ประเภทคือโพรแคริโอตและยูแคริโอต เยื่อหุ้มเซลล์พบในเซลล์ทุกชนิด ผนังเซลล์พบในเซลล์พืชไม่พบในเซลล์สัตว์ สารเคลือบเซลล์พบในเซลล์ทุกชนิด ไซโทพลาสซึม ประกอบด้วยออร์แกแนลล์และไซโทซอล นิวเคลียสเป็นศูนย์กลางควบคุมการทํางานของเซลล์- การแบ่งเซลล์ มี2ขั้นตอน คือ แบ่งนิวเคลียส(ไมโทซิส/ไมโอซสิ ) และแบ่งไซโทพลาสซึม(ในเซลล์พืชจะสร้างแผ่นกั้นเซลล์ เซลล์สัตว์เยื่อหุ้มเซลล์จะคอดเข้าหากันจนแยกออกจากกัน)บทที่ 4 โครโมโซมและสารพันธุกรรม- โครโมโซม คือโครมาทินที่มีการขดตัวทําให้หนาขึ้นและสั้นลง- สารพันธุกรรม เรียกอีกอย่างว่าDNA- สมบัติของสารพันธุกรรม(การจําลองDNA/การสังเคราะห์DNA,การจําลองแบบกึ่งอนุรักษ์,การถอดรหัส,การแปลรหัส,รหัสพันธุกรรม)- มิวเทชัน(ระดับยีน,ระดับโครโมโซม)บทที่ 5 การถ่ายทอดลักษณะทางพันธุกรรม- การศึกษาพันธุกรรมของเมนเดล(กฎการแยก,กฎการรวมกลุ่มอย่างอิสระ,การถ่ายทอดยีนบนโครโมโซม) การ ประยุกต์ใช้กฎของเมนเดล(การผสมทดสอบ,การผสมกลับ)-ลักษณะทางพันธุกรรมที่เป็นส่วนขยายของพันธุศาสตร์เมนเดล(ความเด่นไม่สมบูรณ์,ความเด่นร่วม,มัลติเพิลแอลลีล,ลักษณะควบคุมด้วยยีนหลายคู่,การแปรผันต่อเนื่อง/ไม่ต่อเนื่อง,การถ่ายทอดยีนบนโครโมโซมเพศ)- ยีนบนโครโมโซมเดียวกัน อยู่ใกล้กันมากจะถ่ายทอดไปพร้อมๆกัน เรียกว่า ลิงเกจ การจัดกลุ่มใหม่ของยีนต่างตําแหน่งที่ทําให้ได้กลุ่มยีนที่ต่างไปจากพ่อหรือแม่ เรียกว่า รีคอมบิเนชัน บทที่ 6 เทคโนโลยีทางดีเอ็นเอ- พันธุวิศวกรรมและการโคลนยีน การเพิ่มจํานวนดีเอ็นเอทําได้2วิธี คือ 1.ใช้พลาสมิดของแบคทีเรีย - ใช้ดีเอ็นเอพาหะหรือเวกเตอร์ 2.ทําในหลอดทดลอง(เทคนิคPCR) - ต้องมี ไพรเมอร์ ดีเอ็นเอแม่แบบ นิวคลีโอไทด์ทั้ง4 ชนิด การสร้างดีเอ็นเอรีคอมบิแนนท์-ใช้เอ็นไซม์ตัดจําเพาะตัดสายดีเอ็นเอ และใช้เอนไซม์ดีเอ็นเอไลเกสเชื่อมสายดีเอ็นเอ- การหาขนาดของ DNA และการหาลําดับนิวคลีโอไทด์ – DNA(ใช้เทคนิคเจลอิเล็กโทรฟอรีซิส) นิวคลีโอไทด์ (ใช้เครื่องหาลําดับนิวคลีโอไทด์แบบอัตโนมัติ)- การประยุกต์ใช้เทคโนโลยีทางดีเอ็นเอ(ด้านการแพทย์และเภสัชกรรม,ด้านการเกษตรและอุตสาหกรรม,ด้าน นิติวิทยาศาสตร์)- เทคโนโลยีทางดีเอ็นเอกับความปลอดภัยทางชีวภาพและชีวจริยธรรม(ชีวิตและสุขภาพ,ป้องกันการสูญเสียความหลากหลายทางชีวภาพ,ปฏิบัติต่อสิ่งมีชีวิตอย่างมีคุณธรรม,มุมมองทางสังคมในด้านอื่นๆ)")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "ธาตุ พันธะเคมีและเทคนิคปฏิบัติการ ว31221 ภาคเรียนที่ 1":
            replyObj = TextSendMessage(text="ธาตุ พันธะเคมีและเทคนิคปฏิบัติการ ว31221 ภาคเรียนที่ 1• บทที่1 ความปลอดภัยและทักษะในการปฏิบัติการเคมี ประเภทของสารเคมีต่างๆ การปฏิบัติตนและการวัด ปริมาณสาร หน่วยวัด• บทที่2 แบบจําลองอะตอมต่างๆ การจัดเรียงอิเล็กตรอน ตารางธาตุและสมบัติของธาตุในหมู่หลัก ธาตุแทรน ซิชัน8หมู่ การนํารังสีต่างๆไปใช้ประโยชน์ในชีวิตประจําวัน• บทที่3 พันธะเคมี สัญลักษณ์แบบจุดของลิวอิสและออกเตต การเกิดพันธะไอออนิก คุณสมบัติของสารประกอบไอออนิก เป็นผลึกแข็ง พันธะโคเวเลนต์) ปริมาณสารสัมพันธ์ ว31222 ภาคเรียนที่ 2 บอทตอบกลับว่า :ปริมาณสารสัมพันธ์ ว31222 ภาคเรียนที่ 2• บทที่4 โมลและสูตรเคมีก็จะมีการหาค่ามวลอะตอมสัมพัทธ์ มวลอะตอมเฉลี่ย มวลต่อโมล มวลสูตร ร้อยละโดยมวลของธาตุ• บทที่5 สารละลาย การหาค่าร้อยละโดยมวล ร้อยละโดยปริมาตร ร้อยละโดยมวลต่อปริมาตร")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "ฟิสิกส์กายภาพ ว30111 ภาคเรียนที่ 1":
            replyObj = TextSendMessage(text="ฟิสิกส์กายภาพ ว30111 ภาคเรียนที่ 1  1. บทนํา เนื้อหาที่จะเจอจะเป็นการค้นหาความจริงในทางธรรมชาติโดยหาเหตุผล กฎเกณฑ์ มาอธิบายถึงสิ่งที่ธรรมชาติสร้างขึ้น หรือสิ่งที่เกิดขึ้นเองตามวิถีทางธรรมชาติ ซึ่งจะเห็นได้ว่าฟิสิกส์เป็นเรื่องที่สามารถพบเห็นได้เพราะฟิสิกส์คือความจริงที่สามารถพิสูจน์ได้ บทนี้ก็จะเรียนเกี่ยวกับ การเคลื่อนที่ แรง มวลปริมาณกายภาพและหน่วย การอ่านผลจากเครื่องมือวัด เลขนัยสําคัญ เป็นต้น")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "กลศาสตร์ 2 ว31202 ภาคเรียนที่ 2":
            replyObj = TextSendMessage(text="กลศาสตร์ 2 ว31202 ภาคเรียนที่ 2 1. โมเมนตัมและการชน โมเมนตัมคือการเคลื่อนที่ของวัตถุจะแตกต่างกัน โมเมนตัมจะแบ่งออกเป็น โมเมนตัมเชิงเส้นและโมเมนตัมเชิงมุม ส่วนการชนคือการเกิดแรงกระทําระหว่างกันของวัตถุ การชนก็จะแบ่ง ออกเป็น การชนในหนึ่งมิติ การชนในสองมิติ ชนแบบยืดหยุ่น ชนแบบไม่ยืดหยุ่น เป็นต้น 2. สภาพสมดุล เนื้อหาที่เจอเกี่ยวกับกฎการเคลื่อนที่ของนิวตัน ลักษณะของสมดุล แบ่งออกเป็นสมดุลต่อการเลื่อนตําแหน่ง สมดุลต่อการหมุน และทฤษฎีของลามี")
            line_bot_api.reply_message(rtoken, replyObj)
        elif msg == "ปริมาณสารสัมพันธ์ ว31222 ภาคเรียนที่ 2":
            replyObj = TextSendMessage(text="ปริมาณสารสัมพันธ์ ว31222 ภาคเรียนที่ 2• บทที่4 โมลและสูตรเคมีก็จะมีการหาค่ามวลอะตอมสัมพัทธ์ มวลอะตอมเฉลี่ย มวลต่อโมล มวลสูตร ร้อย ละโดยมวลของธาตุ• บทที่5 สารละลาย การหาค่าร้อยละโดยมวล ร้อยละโดยปริมาตร ร้อยละโดยมวลต่อปริมาตร")
            line_bot_api.reply_message(rtoken, replyObj)                           
        elif msg == "covid":
            url = "https://covid19.ddc.moph.go.th/api/Cases/today-cases-all"
            response = requests.get(url)
            response = response.json()
            replyObj = TextSendMessage(text=str(response))
            line_bot_api.reply_message(rtoken, replyObj)
        else :
            headers = request.headers
            json_headers = ({k:v for k, v in headers.items()})
            json_headers.update({'Host':'bots.dialogflow.com'})
            url = "https://dialogflow.cloud.google.com/v1/integrations/line/webhook/a56aca9e-a0f2-43b6-baa1-a20e066dfb3f"
            requests.post(url,data=json_line, headers=json_headers)
    elif msgType == "image":
        try:
            message_content = line_bot_api.get_message_content(event['message']['id'])
            i = Image.open(BytesIO(message_content.content))
            filename = event['message']['id'] + '.jpg'
            i.save(UPLOAD_FOLDER + filename)
            process_file(os.path.join(UPLOAD_FOLDER, filename), filename)

            url = request.url_root + DOWNLOAD_FOLDER + filename
            
            line_bot_api.reply_message(
                rtoken, [
                    TextSendMessage(text='Object detection result:'),
                    ImageSendMessage(url,url)
                ])    
    
        except:
            message = TextSendMessage(text="เกิดข้อผิดพลาด กรุณาส่งใหม่อีกครั้ง")
            line_bot_api.reply_message(event.reply_token, message)

            return 0

    else:
        sk_id = np.random.randint(1,17)
        replyObj = StickerSendMessage(package_id=str(1),sticker_id=str(sk_id))
        line_bot_api.reply_message(rtoken, replyObj)
    return ''

if __name__ == '__main__':
    app.run()
